ExpressLRS/ExpressLRS/src/lib/HWTIMER/PIC32_Timer_Library.cpp
/****************************************************************************************/
/*																											*/
/*	SimpleTimers.cpp																				*/
/*                                                                                                     		*/
/*	This library provides a simple interface to control the timers on				*/
/*		the PIC32, as well as timer interrupts and PWM								*/
/*																											*/
/***************************************************************************************/
/*	Authors: 	Thomas Kappenman 															*/
/*	Copyright 2014, Digilent Inc.																*/
/***************************************************************************************/
/*  Module Description: 																			*/
/*																											*/
/*	This library provides functions that set up the timers on the PIC32	    	*/
/*	microcontroller. It also provides functions to link timer interrupts to 		*/
/* other functions, and provides an easy way to set up a basic PWM	    	*/
/* signal using output compare modules.													*/
/*																											*/
/**************************************************************************************/
/*  Revision History:																				*/
/*																											*/
/*		8/7/2014(TommyK): Created															*/
/*																											*/
/***************************************************************************************/
/*																											*/
/*		This module was adapted from the PIC32 core library WInterrupts.c	*/
/*		by Mark Sproul and Gene Apperson.												*/
/*																											*/
/***************************************************************************************/

/*
  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#ifndef SIMPLETIMERS_cpp
#define SIMPLETIMERS_cpp

#include "PIC32_Timer_Library.h"


//Global ISR function array
volatile static voidFuncPtr intFunc[5];

/* --------------------------------------------------------------------------------------------------------------------------------------- */
/*	startTimer()
**
**	Parameters:
**		timerNum:	The timer to initialize <TIMER1, TIMER2, TIMER3, TIMER4, TIMER5, TIMER23, TIMER45> 
**		microseconds:	The period, in microseconds, to set the timer to.
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**  Description:
**		Starts the specified timer with a period specified by the user in microseconds.
**
**	Example:
**		startTimer(TIMER23, 10000000);	Starts a 32 bit timer (TIMER2 & TIMER3) with a period of 10 seconds
*/
void startTimer(uint8_t timerNum, long microseconds){

	unsigned long cycles = (F_CPU / 1000000) * microseconds;	//Number of cycles = Cycles per second * Seconds
	if (timerNum < 7){
		switch (timerNum){
			case(TIMER1):
				if(cycles < MAX16BIT)              T1CON=(~T_ON & PS_1_1), PR1=cycles-1, T1CONSET=T_ON;  	// No prescale
				else if((cycles >>= 3) < MAX16BIT) T1CON=(~T_ON & PS_1_8), PR1=cycles-1, T1CONSET=T_ON;      	// Prescale by /8 
				else if((cycles >>= 3) < MAX16BIT) T1CON=(~T_ON & PS_1_64), PR1=cycles-1, T1CONSET=T_ON;   	// Prescale by /64
				else if((cycles >>= 2) < MAX16BIT) T1CON=(~T_ON & PS_1_256), PR1=cycles-1, T1CONSET=T_ON; 	// Prescale by /256
				else        					   T1CON=(~T_ON &  PS_1_256), PR1=MAX16BIT-1, T1CONSET=T_ON; 				// Max period
				break;
			case(TIMER2):
				if(cycles < MAX16BIT)              T2CON=(~T_ON & PS_1_1), PR2=cycles-1, T2CONSET=T_ON;   	// No prescale
				else if((cycles >>= 3) < MAX16BIT) T2CON=(~T_ON & PS_1_8), PR2=cycles-1, T2CONSET=T_ON;         	// Prescale by /8 
				else if((cycles >>= 3) < MAX16BIT) T2CON=(~T_ON & PS_1_64), PR2=cycles-1, T2CONSET=T_ON;   		// Prescale by /64
				else if((cycles >>= 2) < MAX16BIT) T2CON=(~T_ON & PS_1_256), PR2=cycles-1, T2CONSET=T_ON;    	// Prescale by /256
				else        					   T2CON=(~T_ON & PS_1_256), PR2=MAX16BIT-1, T2CONSET=T_ON;	// Max period
				break;
			case(TIMER3):
				if(cycles < MAX16BIT)              T3CON=(~T_ON &  PS_1_1), PR3=cycles-1, T3CONSET=T_ON;    // No prescale
				else if((cycles >>= 3) < MAX16BIT) T3CON=(~T_ON &  PS_1_8), PR3=cycles-1, T3CONSET=T_ON;         // Prescale by /8 
				else if((cycles >>= 3) < MAX16BIT) T3CON=(~T_ON &  PS_1_64), PR3=cycles-1, T3CONSET=T_ON;   	 	// Prescale by /64
				else if((cycles >>= 2) < MAX16BIT) T3CON=(~T_ON &  PS_1_256), PR3=cycles-1, T3CONSET=T_ON;     	// Prescale by /256
				else        					   T3CON=(~T_ON &  PS_1_256), PR3=MAX16BIT-1, T3CONSET=T_ON; 		// Max period
				break;
			case(TIMER4):
				if(cycles < MAX16BIT)             T4CON=(~T_ON & PS_1_1), PR4=cycles-1, T4CONSET=T_ON;           // No prescale
				else if((cycles >>= 3) < MAX16BIT)T4CON=(~T_ON & PS_1_8), PR4=cycles-1, T4CONSET=T_ON;       // Prescale by /8 
				else if((cycles >>= 3) < MAX16BIT)T4CON=(~T_ON & PS_1_64), PR4=cycles-1, T4CONSET=T_ON; 	// Prescale by /64
				else if((cycles >>= 2) < MAX16BIT)T4CON=(~T_ON & PS_1_256), PR4=cycles-1, T4CONSET=T_ON;  // Prescale by /256
				else        					  T4CON=(~T_ON & PS_1_256), PR4=MAX16BIT-1, T4CONSET=T_ON; // Max period
				break;
			case(TIMER5):
				if(cycles < MAX16BIT)             T5CON=(~T_ON & PS_1_1), PR5=cycles-1, T5CONSET=T_ON;             // No prescale
				else if((cycles >>= 3) < MAX16BIT)T5CON=(~T_ON & PS_1_8), PR5=cycles-1, T5CONSET=T_ON;        // Prescale by /8
				else if((cycles >>= 3) < MAX16BIT)T5CON=(~T_ON & PS_1_64), PR5=cycles-1, T5CONSET=T_ON;  	// Prescale by /64
				else if((cycles >>= 2) < MAX16BIT)T5CON=(~T_ON & PS_1_256), PR5=cycles-1, T5CONSET=T_ON;   	// Prescale by /256
				else        					  T5CON=(~T_ON & PS_1_256), PR5=MAX16BIT-1, T5CONSET=T_ON; 	// Max period
				break;
			case(TIMER23):
				if(cycles < MAX32BIT)				T2CON=(~T_ON & T_32_BIT_MODE_ON | PS_1_1), PR2=cycles-1, T2CONSET=T_ON;	//No prescale
				else if((cycles >>= 3) < MAX32BIT)	T2CON=(~T_ON & T_32_BIT_MODE_ON | PS_1_8), PR2=cycles-1, T2CONSET=T_ON;  	//Prescale by /8
				else if((cycles >>= 3) < MAX32BIT)	T2CON=(~T_ON & T_32_BIT_MODE_ON | PS_1_64), PR2=cycles-1, T2CONSET=T_ON; 	//Prescale by /64
				else if((cycles >>= 2) < MAX32BIT)	T2CON=(~T_ON & T_32_BIT_MODE_ON | PS_1_256), PR2=cycles-1, T2CONSET=T_ON;	//Prescale by /256
				else								T2CON=(~T_ON & T_32_BIT_MODE_ON | PS_1_256), PR2=MAX16BIT-1, T2CONSET=T_ON;	//Max period possible
				break;
			case(TIMER45):
				if(cycles < MAX32BIT)				T4CON=(~T_ON &  T_32_BIT_MODE_ON | PS_1_1), PR4=cycles-1, T4CONSET=T_ON;	//No prescale
				else if((cycles >>= 3) < MAX32BIT)	T2CON=(~T_ON &  T_32_BIT_MODE_ON | PS_1_8), PR4=cycles-1, T4CONSET=T_ON;  	//Prescale by /8
				else if((cycles >>= 3) < MAX32BIT)	T2CON=(~T_ON &  T_32_BIT_MODE_ON | PS_1_64), PR4=cycles-1, T4CONSET=T_ON; 	//Prescale by /64
				else if((cycles >>= 2) < MAX32BIT)	T2CON=(~T_ON &  T_32_BIT_MODE_ON | PS_1_256), PR4=cycles-1, T4CONSET=T_ON;	//Prescale by /256
				else								T2CON=(~T_ON &  T_32_BIT_MODE_ON | PS_1_256), PR4=MAX16BIT-1, T4CONSET=T_ON;	//Max period possible
				break;
		}
	}
}

/* --------------------------------------------------------------------------------------------------------------------------------------- */
/*	stopTimer()
**
**	Parameters:
**		timerNum:	The timer to stop <TIMER1, TIMER2, TIMER3, TIMER4, TIMER5, TIMER23, TIMER45> 
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**  Description:
**		Stops the specified timer
**
**	Example:
**		stopTimer(TIMER23)	Stops the 32 bit timer (TIMER2 & TIMER3)
*/
void stopTimer(uint8_t timerNum){
	if (timerNum < 7){
		switch(timerNum){
			case TIMER1:IEC0CLR = _IEC0_T1IE_MASK, T1CON = 0x0;
				break;
			case TIMER2:IEC0CLR = _IEC0_T2IE_MASK, T2CON = 0x0;
				break;
			case TIMER3:IEC0CLR = _IEC0_T3IE_MASK, T3CON = 0x0;
				break;
			case TIMER4:IEC0CLR = _IEC0_T4IE_MASK, T4CON = 0x0;
				break;
			case TIMER5:IEC0CLR = _IEC0_T5IE_MASK, T5CON = 0x0;
				break;
			case TIMER23:IEC0CLR = _IEC0_T3IE_MASK, T2CON = 0x0,T3CON = 0x0;
				break;
			case TIMER45:IEC0CLR = _IEC0_T5IE_MASK, T4CON = 0x0, T5CON = 0x0;
				break;
		}
	}
}

/* --------------------------------------------------------------------------------------------------------------------------------------- */
/*	setTimerPeriod()
**
**	Parameters:
**		timerNum:	The timer to set the period of <TIMER1, TIMER2, TIMER3, TIMER4, TIMER5, TIMER23, TIMER45> 
**
**	Return Value:
**		none
**
**	Errors:
**		At the moment, just calls startTimer(), this also enables the timer. This function is
**		mainly for the name.
**
**  Description:
**		Starts the specified timer with the specified period in microseconds
**
**	Example:
**		startTimer(TIMER4, 100000);	Starts a 16 bit timer (TIMER4) with a period of 100 milliseconds.
*/
void setTimerPeriod(uint8_t timerNum, long microseconds){
	startTimer(timerNum, microseconds);
}

/* --------------------------------------------------------------------------------------------------------------------------------------- */
/*	timerReset()
**
**	Parameters:
**		timerNum:	The timer to reset <TIMER1, TIMER2, TIMER3, TIMER4, TIMER5, TIMER23, TIMER45> 
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**  Description:
**		Resets the value of the timer counter to 0.
**
**	Example:
**		timerReset(TIMER23);	Resets the 32 bit timer 2-3 count to 0.
*/
void timerReset(uint8_t timerNum){
	switch(timerNum){
		case TIMER1: TMR1=0;
			break;
		case TIMER2: TMR2=0;
			break;
		case TIMER3: TMR3=0;
			break;
		case TIMER4: TMR4=0;
			break;
		case TIMER5: TMR5=0;
			break;
		case TIMER23: TMR2=0;TMR3=0;
			break;
		case TIMER45: TMR4=0;TMR5=0;
			break;
	}
}
/* --------------------------------------------------------------------------------------------------------------------------------------- */
/*	attachTimerInterrupt()
**
**	Parameters:
**		timerNum:	The timer interrupt to set <TIMER1, TIMER2, TIMER3, TIMER4, TIMER5, TIMER23, TIMER45> 
**		userfunc:	The interrupt service routine to jump to when the interrupt is triggered
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**  Description:
**		Specifies a function as an interrupt service routine for a timer.
**
**	Example:
**		attachTimerInterrupt(TIMER23, toggleLED);	Attaches the 32 bit timer 2-3 to the function toggleLED();
*/
void attachTimerInterrupt(uint8_t timerNum, void (*userFunc)(void))
{
    if (timerNum < 7)
    {
		if (timerNum==TIMER23)	timerNum=TIMER3;
		else if (timerNum==TIMER45)	timerNum=TIMER5;
		
        intFunc[timerNum]	=	userFunc;

